In [2]:
import pandas as pd

In [4]:
df = pd.DataFrame({'a': [1, 2], 'b': [3, 4]})
df

   a  b
0  1  3
1  2  4

In [11]:
ser = pd.Series([7, 8]).rename('meow')
ser

0    1
1    2
2    3
Name: meow, dtype: int64

In [12]:
df.assign(c=ser)

   a  b  c
0  1  3  1
1  2  4  2

In [16]:
df.iloc[:, 0]

0    1
1    2
Name: a, dtype: int64

In [31]:
df.rename(columns={df.columns[0]: df.columns[0] + '_woof'})

   a_woof  b
0       1  3
1       2  4

In [36]:
pd.concat([df, df.shift(1)] ,axis=1)

   a  b    a    b
0  1  3  NaN  NaN
1  2  4  1.0  3.0